Revit 2026 API

# CompoundStructureIsValid Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid(
	Document doc,
	out IDictionary<int, CompoundStructureError> errMap,
	out IDictionary<int, int> twoLayerErrorsMap
)
```
```vb
Public Function IsValid (
	doc As Document,
	<OutAttribute> ByRef errMap As IDictionary(Of Integer, CompoundStructureError),
	<OutAttribute> ByRef twoLayerErrorsMap As IDictionary(Of Integer, Integer)
) As Boolean
```
```cpp
public:
bool IsValid(
	Document^ doc,
	[OutAttribute] IDictionary<int, CompoundStructureError>^% errMap,
	[OutAttribute] IDictionary<int, int>^% twoLayerErrorsMap
)
```
```fsharp
member IsValid :
        doc : Document *
        errMap : IDictionary<int, CompoundStructureError> byref *
        twoLayerErrorsMap : IDictionary<int, int> byref -> bool
```

#### Parameters

doc Document

errMap IDictionaryInt32, CompoundStructureError

twoLayerErrorsMap IDictionaryInt32, Int32

#### Return Value

Boolean

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace